meeting/agenda/2025/04-08.org
:PROPERTIES:
:ID:       ACC57313-D648-4BC2-961C-311E583F5703
:END:
#+title: QT4 CG Meeting 116 Agenda 2025-04-08
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/03-25.html][the previous meeting]] (25 March; there was no meeting on 1 April).

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 8 April 2025. The following meeting is scheduled
for 15 April 2025. 

** Review of open action items [0/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-107-05: JLO and DN to consider a proposal for system defined records.
+ [ ] QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.
+ [ ] QT4CG-113-02: NW to investigate a way to show extra attributes in the syntax summary.
+ [ ] QT4CG-115-01: MK to give an example of params passed automatically through next-match using a 3.0 version control
+ [ ] QT4CG-115-02: JWL to write a few tests for xsl:record

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1888][#1888]]: 366 xsl:package-location
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1913][#1913]]: 1911 Clarifications for regular expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1904][#1904]]: 1832 Operator Associativity
+ PR [[https://qt4cg.org/dashboard/#pr-1898][#1898]]: 1624b Expand rules for document node subtyping

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1900][#1900]]: Records: instance checks
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1846][#1846]]: %method functions, dynamic function calls
+ Issue [[https://github.com/qt4cg/qtspecs/issues/982][#982]]: scan-left, scan-right: position argument, array functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/564][#564]]: Sorted maps

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1915][#1915]]: 1902b bin:unpack out of range error
+ PR [[https://qt4cg.org/dashboard/#pr-1914][#1914]]: 501 Error handling: try/finally
+ PR [[https://qt4cg.org/dashboard/#pr-1910][#1910]]: 1021 (part 1) Add $options arg to doc() and doc-available()
+ PR [[https://qt4cg.org/dashboard/#pr-1908][#1908]]: 1520 Allow forwards references to named item types
+ PR [[https://qt4cg.org/dashboard/#pr-1906][#1906]]: 1797 elements-to-maps-conversion-plan function
+ PR [[https://qt4cg.org/dashboard/#pr-1901][#1901]]: 1363 fallback becomes a value not a function
+ PR [[https://qt4cg.org/dashboard/#pr-1897][#1897]]: 1876 In fn:replace(), merge the $replacement and $action parameters
+ PR [[https://qt4cg.org/dashboard/#pr-1895][#1895]]: 1881 Function identity for maps and arrays
+ PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]: Additional examples to fn:chain - in a new branch
+ PR [[https://qt4cg.org/dashboard/#pr-1883][#1883]]: 882 Replace fn:chain by fn:compose
+ PR [[https://qt4cg.org/dashboard/#pr-1819][#1819]]: 451 Multiple schemas in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-1587][#1587]]: 557 Add fn:binary-resource

