meeting/agenda/2025/04-08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 116 Agenda 2025-04-08</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 116 Agenda 2025-04-08</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/03-25.html">the previous meeting</a> (25 March; there was no meeting on 1 April).
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 8 April 2025. The following meeting is scheduled
for 15 April 2025. 
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-107-05: JLO and DN to consider a proposal for system defined records.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-113-02: NW to investigate a way to show extra attributes in the syntax summary.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-115-01: MK to give an example of params passed automatically through next-match using a 3.0 version control</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-115-02: JWL to write a few tests for xsl:record</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1888">#1888</a>: 366 xsl:package-location</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1913">#1913</a>: 1911 Clarifications for regular expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1904">#1904</a>: 1832 Operator Associativity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1898">#1898</a>: 1624b Expand rules for document node subtyping</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1900">#1900</a>: Records: instance checks</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1846">#1846</a>: %method functions, dynamic function calls</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/982">#982</a>: scan-left, scan-right: position argument, array functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/564">#564</a>: Sorted maps</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1915">#1915</a>: 1902b bin:unpack out of range error</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1914">#1914</a>: 501 Error handling: try/finally</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1910">#1910</a>: 1021 (part 1) Add $options arg to doc() and doc-available()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1908">#1908</a>: 1520 Allow forwards references to named item types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1906">#1906</a>: 1797 elements-to-maps-conversion-plan function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1901">#1901</a>: 1363 fallback becomes a value not a function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1897">#1897</a>: 1876 In fn:replace(), merge the $replacement and $action parameters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1895">#1895</a>: 1881 Function identity for maps and arrays</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>: Additional examples to fn:chain - in a new branch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1883">#1883</a>: 882 Replace fn:chain by fn:compose</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1819">#1819</a>: 451 Multiple schemas in XSLT</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1587">#1587</a>: 557 Add fn:binary-resource</li>
</ul>
</div>
</div>
