meeting/agenda/2025/04-08.org
*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1742][#1742]]: Maps constructed using streamed xsl:fork instruction should not be ordered
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/714][#714]]: Function annotations in XSLT
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: try/finally
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/366][#366]]: Support xsl:use-package with xsl:package-location
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

*** To be triaged
:PROPERTIES:
:CUSTOM_ID: triage
:END:

The following issues need to be triaged.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1912][#1912]]: Error handling: `fn:throw`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1911][#1911]]: Remarks on recent changes to regular expression handling
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1907][#1907]]: Method lookup: wildcards
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1905][#1905]]: Editorial edits
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1903][#1903]]: `fn:scan-left`, `fn:scan-right`: missing steps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1896][#1896]]: Drop "parameter names" as a property of a function item
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1891][#1891]]: `fn:parse-html`: `html-version`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1889][#1889]]: HTML serialization: `html-version` and `version` parameters; allowed values
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1885][#1885]]: Use the spcification grammar markup to define the regular expression grammar in F&O
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1871][#1871]]: Arrays and maps: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1868][#1868]]: array:members() to include index position
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1859][#1859]]: Question on `fn:chain` and `err:FOAP0001`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1852][#1852]]: fn:values-except: Return atomic values that occur in A but not in B
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1846][#1846]]: %method functions, dynamic function calls
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1844][#1844]]: Drop mapping arrow operator
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1799][#1799]]: "well-formed HTML document"?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1795][#1795]]: XSLT templates: Matching values in a map by key
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1787][#1787]]: Sorted maps revisited
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1775][#1775]]: Navigation in JSON trees
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1774][#1774]]: Nomenclature: relabelling
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1754][#1754]]: Inverse functions to bin:hex, bin:bin, and bin:octal
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1736][#1736]]: Add option retain-order=false when constructing maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1718][#1718]]: Ordered Maps: positions in callback functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1704][#1704]]: Ignore the byte order mark more completely/globally
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1697][#1697]]: Add documentary names to callback function signatures
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1661][#1661]]: QName arguments: also allow strings
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1644][#1644]]: fn:elements-to-maps: Mixed Content
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1618][#1618]]: Adaptive serialization: doubles
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1591][#1591]]: Implausible filter expressions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1583][#1583]]: JSON: Parsing and serializing numbers, often undesired E notation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1568][#1568]]: Define a Unicode case-insensitive collation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1528][#1528]]: Computed node constructors: observations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1484][#1484]]: Functions that expect a record type should make it extensible
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1479][#1479]]: Default element namespace in XQuery: interaction of 'fixed' and '##any'
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1459][#1459]]: Function properties and arities (editorial)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1416][#1416]]: Key-value pairs: built-in record type `pair`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1310][#1310]]: add fn:match-groups() function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1307][#1307]]: For symmetry, add functions array:scan-left and array:scan-right
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1271][#1271]]: Schema validation in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1175][#1175]]: XPath: Optional parameters in the definition of an inline function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/760][#760]]: Serialize functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]: Serialization fallback.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/119][#119]]: Allow a map's key value to be any sequence

