meeting/agenda/2025/04-08.html

<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1742">#1742</a>: Maps constructed using streamed xsl:fork instruction should not be ordered</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1240">#1240</a>: $sequence-of-maps ? info()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1127">#1127</a>: Binary resources</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1021">#1021</a>: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/967">#967</a>: XPath Appendix I: Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/826">#826</a>: Arrays: Representation of single members of an array</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/748">#748</a>: Parse functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/714">#714</a>: Function annotations in XSLT</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: try/finally</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/366">#366</a>: Support xsl:use-package with xsl:package-location</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>

<div id="outline-container-triage" class="outline-4">
<h4 id="triage"><span class="section-number-4">1.6.6.</span> To be triaged</h4>
<div class="outline-text-4" id="text-triage">
<p>
The following issues need to be triaged.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1912">#1912</a>: Error handling: `fn:throw`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1911">#1911</a>: Remarks on recent changes to regular expression handling</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1907">#1907</a>: Method lookup: wildcards</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1905">#1905</a>: Editorial edits</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1903">#1903</a>: `fn:scan-left`, `fn:scan-right`: missing steps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1896">#1896</a>: Drop "parameter names" as a property of a function item</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1891">#1891</a>: `fn:parse-html`: `html-version`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1889">#1889</a>: HTML serialization: `html-version` and `version` parameters; allowed values</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1885">#1885</a>: Use the spcification grammar markup to define the regular expression grammar in F&amp;O</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1871">#1871</a>: Arrays and maps: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1868">#1868</a>: array:members() to include index position</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1859">#1859</a>: Question on `fn:chain` and `err:FOAP0001`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1852">#1852</a>: fn:values-except: Return atomic values that occur in A but not in B</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1846">#1846</a>: %method functions, dynamic function calls</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1844">#1844</a>: Drop mapping arrow operator</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1799">#1799</a>: "well-formed HTML document"?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1795">#1795</a>: XSLT templates: Matching values in a map by key</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1787">#1787</a>: Sorted maps revisited</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1775">#1775</a>: Navigation in JSON trees</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1774">#1774</a>: Nomenclature: relabelling</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1754">#1754</a>: Inverse functions to bin:hex, bin:bin, and bin:octal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1736">#1736</a>: Add option retain-order=false when constructing maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1718">#1718</a>: Ordered Maps: positions in callback functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1704">#1704</a>: Ignore the byte order mark more completely/globally</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1697">#1697</a>: Add documentary names to callback function signatures</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1661">#1661</a>: QName arguments: also allow strings</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1644">#1644</a>: fn:elements-to-maps: Mixed Content</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1618">#1618</a>: Adaptive serialization: doubles</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1591">#1591</a>: Implausible filter expressions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1583">#1583</a>: JSON: Parsing and serializing numbers, often undesired E notation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1568">#1568</a>: Define a Unicode case-insensitive collation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1528">#1528</a>: Computed node constructors: observations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1484">#1484</a>: Functions that expect a record type should make it extensible</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1479">#1479</a>: Default element namespace in XQuery: interaction of 'fixed' and '##any'</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1459">#1459</a>: Function properties and arities (editorial)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1416">#1416</a>: Key-value pairs: built-in record type `pair`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1310">#1310</a>: add fn:match-groups() function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1307">#1307</a>: For symmetry, add functions array:scan-left and array:scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1271">#1271</a>: Schema validation in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1175">#1175</a>: XPath: Optional parameters in the definition of an inline function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/760">#760</a>: Serialize functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>: Serialization fallback.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>: Allow a map's key value to be any sequence</li>
</ul>
</div>
</div>
</div>
</div>
