meeting/agenda/2025/04-08.org
* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

We do need to get back to issue triage, but in the interest of “catching up”,
let’s plan to focus on PRs this week. I’ve tried to order them with the “easy”
ones first, but suggestions for reordering a perfectly in order. (No pun
intended.)

I don’t actually think we’ll get through all of these, but let’s try to
prioritize finishing the small ones over discussing the big ones where
practical.

** Review of pull requests
:PROPERTIES:
:CUSTOM_ID: technical-prs
:END:

*** PR #1915: 1902b bin:unpack out of range error
:PROPERTIES:
:CUSTOM_ID: pr-1915
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1915][#1915]]

*** PR #1914: 501 Error handling: try/finally
:PROPERTIES:
:CUSTOM_ID: pr-1914
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1914][#1914]]

*** PR #1910: 1021 (part 1) Add $options arg to doc() and doc-available()
:PROPERTIES:
:CUSTOM_ID: pr-1910
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1910][#1910]]

*** PR #1908: 1520 Allow forwards references to named item types
:PROPERTIES:
:CUSTOM_ID: pr-1908
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1908][#1908]]

*** PR #1897: 1876 In fn:replace(), merge the $replacement and $action parameters
:PROPERTIES:
:CUSTOM_ID: pr-1897
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1897][#1897]]

*** PR #1895: 1881 Function identity for maps and arrays
:PROPERTIES:
:CUSTOM_ID: pr-1895
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1895][#1895]]

*** PR #1901: 1363 fallback becomes a value not a function
:PROPERTIES:
:CUSTOM_ID: pr-1901
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1901][#1901]]

*** PR #1819: 451 Multiple schemas in XSLT
:PROPERTIES:
:CUSTOM_ID: pr-1819
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1819][#1819]]

*** PR #1587: 557 Add fn:binary-resource
:PROPERTIES:
:CUSTOM_ID: pr-1587
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1587][#1587]]

*** PR #1906: 1797 elements-to-maps-conversion-plan function
:PROPERTIES:
:CUSTOM_ID: pr-1906
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1906][#1906]]

*** PR #1894: Additional examples to fn:chain - in a new branch
:PROPERTIES:
:CUSTOM_ID: pr-1894
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]

*** PR #1883: 882 Replace fn:chain by fn:compose
:PROPERTIES:
:CUSTOM_ID: pr-1883
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1883][#1883]]


** Issue triage
:PROPERTIES:
:CUSTOM_ID: technical-triage
:END:

*** Issue #1832: Associativity of Operators, especially "||" (Appendix A.5)
:PROPERTIES:
:CUSTOM_ID: issue-1832
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1832][#1832]]
*** Issue #1799: "well-formed HTML document"?
:PROPERTIES:
:CUSTOM_ID: issue-1799
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1799][#1799]]
*** Issue #1797: elements-to-maps: separate function to construct a plan
:PROPERTIES:
:CUSTOM_ID: issue-1797
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1797][#1797]]
*** Issue #760: Serialize functions: consistency
:PROPERTIES:
:CUSTOM_ID: issue-760
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/760][#760]]
*** Issue #641: Serialization fallback.
:PROPERTIES:
:CUSTOM_ID: issue-641
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]
*** Issue #119: Allow a map's key value to be any sequence
:PROPERTIES:
:CUSTOM_ID: issue-119
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/119][#119]]


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
