meeting/agenda/2025/04-08.html

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
We do need to get back to issue triage, but in the interest of “catching up”,
let’s plan to focus on PRs this week. I’ve tried to order them with the “easy”
ones first, but suggestions for reordering a perfectly in order. (No pun
intended.)
</p>

<p>
I don’t actually think we’ll get through all of these, but let’s try to
prioritize finishing the small ones over discussing the big ones where
practical.
</p>
</div>

<div id="outline-container-technical-prs" class="outline-3">
<h3 id="technical-prs"><span class="section-number-3">2.1.</span> Review of pull requests</h3>
<div class="outline-text-3" id="text-technical-prs">
</div>

<div id="outline-container-pr-1915" class="outline-4">
<h4 id="pr-1915"><span class="section-number-4">2.1.1.</span> PR #1915: 1902b bin:unpack out of range error</h4>
<div class="outline-text-4" id="text-pr-1915">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1915">#1915</a>
</p>
</div>
</div>

<div id="outline-container-pr-1914" class="outline-4">
<h4 id="pr-1914"><span class="section-number-4">2.1.2.</span> PR #1914: 501 Error handling: try/finally</h4>
<div class="outline-text-4" id="text-pr-1914">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1914">#1914</a>
</p>
</div>
</div>

<div id="outline-container-pr-1910" class="outline-4">
<h4 id="pr-1910"><span class="section-number-4">2.1.3.</span> PR #1910: 1021 (part 1) Add $options arg to doc() and doc-available()</h4>
<div class="outline-text-4" id="text-pr-1910">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1910">#1910</a>
</p>
</div>
</div>

<div id="outline-container-pr-1908" class="outline-4">
<h4 id="pr-1908"><span class="section-number-4">2.1.4.</span> PR #1908: 1520 Allow forwards references to named item types</h4>
<div class="outline-text-4" id="text-pr-1908">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1908">#1908</a>
</p>
</div>
</div>

<div id="outline-container-pr-1897" class="outline-4">
<h4 id="pr-1897"><span class="section-number-4">2.1.5.</span> PR #1897: 1876 In fn:replace(), merge the $replacement and $action parameters</h4>
<div class="outline-text-4" id="text-pr-1897">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1897">#1897</a>
</p>
</div>
</div>

<div id="outline-container-pr-1895" class="outline-4">
<h4 id="pr-1895"><span class="section-number-4">2.1.6.</span> PR #1895: 1881 Function identity for maps and arrays</h4>
<div class="outline-text-4" id="text-pr-1895">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1895">#1895</a>
</p>
</div>
</div>

<div id="outline-container-pr-1901" class="outline-4">
<h4 id="pr-1901"><span class="section-number-4">2.1.7.</span> PR #1901: 1363 fallback becomes a value not a function</h4>
<div class="outline-text-4" id="text-pr-1901">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1901">#1901</a>
</p>
</div>
</div>

<div id="outline-container-pr-1819" class="outline-4">
<h4 id="pr-1819"><span class="section-number-4">2.1.8.</span> PR #1819: 451 Multiple schemas in XSLT</h4>
<div class="outline-text-4" id="text-pr-1819">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1819">#1819</a>
</p>
</div>
</div>

<div id="outline-container-pr-1587" class="outline-4">
<h4 id="pr-1587"><span class="section-number-4">2.1.9.</span> PR #1587: 557 Add fn:binary-resource</h4>
<div class="outline-text-4" id="text-pr-1587">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1587">#1587</a>
</p>
</div>
</div>

<div id="outline-container-pr-1906" class="outline-4">
<h4 id="pr-1906"><span class="section-number-4">2.1.10.</span> PR #1906: 1797 elements-to-maps-conversion-plan function</h4>
<div class="outline-text-4" id="text-pr-1906">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1906">#1906</a>
</p>
</div>
</div>

<div id="outline-container-pr-1894" class="outline-4">
<h4 id="pr-1894"><span class="section-number-4">2.1.11.</span> PR #1894: Additional examples to fn:chain - in a new branch</h4>
<div class="outline-text-4" id="text-pr-1894">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>
</p>
</div>
</div>

<div id="outline-container-pr-1883" class="outline-4">
<h4 id="pr-1883"><span class="section-number-4">2.1.12.</span> PR #1883: 882 Replace fn:chain by fn:compose</h4>
<div class="outline-text-4" id="text-pr-1883">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1883">#1883</a>
</p>
</div>
</div>
</div>


<div id="outline-container-technical-triage" class="outline-3">
<h3 id="technical-triage"><span class="section-number-3">2.2.</span> Issue triage</h3>
<div class="outline-text-3" id="text-technical-triage">
</div>

<div id="outline-container-issue-1832" class="outline-4">
<h4 id="issue-1832"><span class="section-number-4">2.2.1.</span> Issue #1832: Associativity of Operators, especially "||" (Appendix A.5)</h4>
<div class="outline-text-4" id="text-issue-1832">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/1832">#1832</a>
</p>
</div>
</div>
<div id="outline-container-issue-1799" class="outline-4">
<h4 id="issue-1799"><span class="section-number-4">2.2.2.</span> Issue #1799: "well-formed HTML document"?</h4>
<div class="outline-text-4" id="text-issue-1799">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/1799">#1799</a>
</p>
</div>
</div>
<div id="outline-container-issue-1797" class="outline-4">
<h4 id="issue-1797"><span class="section-number-4">2.2.3.</span> Issue #1797: elements-to-maps: separate function to construct a plan</h4>
<div class="outline-text-4" id="text-issue-1797">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/1797">#1797</a>
</p>
</div>
</div>
<div id="outline-container-issue-760" class="outline-4">
<h4 id="issue-760"><span class="section-number-4">2.2.4.</span> Issue #760: Serialize functions: consistency</h4>
<div class="outline-text-4" id="text-issue-760">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/760">#760</a>
</p>
</div>
</div>
<div id="outline-container-issue-641" class="outline-4">
<h4 id="issue-641"><span class="section-number-4">2.2.5.</span> Issue #641: Serialization fallback.</h4>
<div class="outline-text-4" id="text-issue-641">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>
</p>
</div>
</div>
<div id="outline-container-issue-119" class="outline-4">
<h4 id="issue-119"><span class="section-number-4">2.2.6.</span> Issue #119: Allow a map's key value to be any sequence</h4>
<div class="outline-text-4" id="text-issue-119">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
